<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bc4f7c91253546baa98d61a76937e684ca039548b1895b62878c77e4fa3198cc","plan_job_ref":"Job Terraform plan (OIDC) #28 at https://github.com/hackforla/incubator/actions/runs/13876984639","plan_out_hash":"13d41ad651f185728a25683b73a705502b2b0b453a5587ae68a1f2d728588fac","plan_hash":"ffa772a20883a6d7c83a3e652619dc70752c24e91ab138056c84af50b4d79cff","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 2 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_dns_entry.aws_route53_record.www must be replaced
-/+ resource "aws_route53_record" "www" {
+       allow_overwrite                  = (known after apply)
!~      fqdn                             = "stage.civictechjobs.com" -> (known after apply)
!~      id                               = "*********************************" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
!~      name                             = "stage" -> "civictechjobs-stage" # forces replacement
!~      zone_id                          = "Z03052251DU06DMBYE89K" -> "Z0420800PGQ9JP6DM9EX" # forces replacement
#        (5 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_service.fargate[0] will be updated in-place
!~  resource "aws_ecs_service" "fargate" {
        id                                 = "arn:aws:ecs:us-west-2:035866691871:service/incubator-prod/civic-tech-jobs-fs-stage"
        name                               = "civic-tech-jobs-fs-stage"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:2" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
!~      arn                      = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:2" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "************************" -> (known after apply)
!~      revision                 = 2 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_lb_listener_rule.static will be updated in-place
!~  resource "aws_lb_listener_rule" "static" {
        id           = "arn:aws:elasticloadbalancing:us-west-2:035866691871:listener-rule/app/incubator-prod-lb/7451adf77133ef36/390a225766a4daf3/8b944647d0d45e1e"
        tags         = {}
#        (4 unchanged attributes hidden)

-       condition {
-           host_header {
-               values = [
-                   "stage.civictechjobs.com",
                ] -> null
            }
        }
+       condition {
+           host_header {
+               values = [
+                   "civictechjobs-stage.vrms.io",
                ]
            }
        }

#        (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan (OIDC) #28](https://github.com/hackforla/incubator/actions/runs/13876984639)